In [2]:
import pandas as pd

In [3]:
dataset = pd.read_csv('Churn-Modelling.csv')
dataset

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Unnamed: 14
0,1,15634602,Hargrave,619,France,Female,42,2,0K,1,1,1,101348.88,1,NaN
1,2,15647311,Hill,608,Spain,Female,41,1,84K,1,0,1,112542.58,0,NaN
2,3,15619304,Onio,502,France,Female,42,8,160K,3,1,0,113931.57,1,NaN
3,4,15701354,Boni,699,France,Female,39,1,0K,2,0,0,93826.63,0,NaN
4,5,15737888,Mitchell,850,Spain,Female,43,2,126K,1,1,1,79084.10,0,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,15606229,Obijiaku,771,France,Male,39,5,0K,2,1,0,96270.64,0,NaN
9996,9997,15569892,Johnstone,516,France,Male,35,10,57K,1,1,1,101699.77,0,NaN
9997,9998,15584532,Liu,709,France,Female,36,7,0K,1,0,1,42085.58,1,NaN
9998,9999,15682355,Sabbatini,772,Germany,Male,42,3,75K,2,1,0,92888.52,1,NaN
9999,10000,15628319,Walker,792,France,Female,28,4,130K,1,1,0,38190.78,0,NaN

In [4]:
filteredData = dataset[dataset['Gender'] == 'Male']
filteredData.shape

(5457, 15)

1.5.3